#include <iostream>
using namespace std;

int main()
{
	const int SIZE = 11;
	int arr[SIZE] = {};
    
    // Грешката беше, че нямахме база! Винаги трябва да имаме база при рекурентно зададените формули
	arr[0] = 1; // Даваме база -> първото число на Каталан
                // Всички останали елементи трябва да са инициализирани с 0, защото работим със сбор, а не можем да събираме
                // неинициализирани променливи. 0 е неутралният елемент по отношение на събирането, затова е дефолтна стойност на инициализацията

	for (int i = 1; i < 11; i++) // След като имаме база започваме от 1вия индекс
		for (int j = i - 1; j >= 0; j--) // Искаме да умножим всички двойки предишни елементи и сумата им ще бъде нашия (това е самата формула)
			arr[i] += arr[j] * arr[i - j - 1]; // Разписваме формулата

	for (int i = 0; i < 11; i++)
		cout << arr[i] << ' ';
	cout << endl;

}